<template>
    <div class="acontent" v-html="content">{{ content }}</div>
</template>


<script>
export default {
    name : 'acontent',
    props: ['content'],
    data(){
        return {
            text : `
                <div>旅游局网站10月3日消息，国庆中秋假日第三天，全国旅游市场持续增长，市场运行平稳，无重大涉旅安全事件发生。据国家旅游局数据中心综合测算，10月3日，全国共接待国内游客1.19亿人次，同比增长9.8%，实现国内旅游收入984亿元，同比增长11.8%。</div>
                <div>中秋将至，部分短程游回程叠加周边游出行，旅游客流保持高位运行。家庭出游特征更加突出。逛街购物、品尝美食、主题节事活动等提升了游客体验。滨海度假、主题乐园等一站式度假区、旅游综合体受家庭客群欢迎。假日旅游对国内居民消费拉动作用凸显。</div>
                <div>美国当地时间10月1日晚，美国拉斯维加斯露天音乐节发生枪击事件，已造成58人死亡，515人受伤。事件发生后，国家旅游局高度重视，要求驻洛杉矶旅游办事处迅速了解相关情况，与我使领馆保持密切联系，确认在当地中国游客的安危情况，要求国内出境旅游企业立即核查游客信息。目前暂无涉中国公民伤亡报告，有6名游客被困事发封锁区域，现已全部安全离开。国家旅游局将进一步跟踪事件进展，并提醒广大出境游游客注意安全。</div>
                <div><img src="static/video-bg.jpg"></div>
                <div>旅游局网站10月3日消息，国庆中秋假日第三天，全国旅游市场持续增长，市场运行平稳，无重大涉旅安全事件发生。据国家旅游局数据中心综合测算，10月3日，全国共接待国内游客1.19亿人次，同比增长9.8%，实现国内旅游收入984亿元，同比增长11.8%。</div>
                <div>中秋将至，部分短程游回程叠加周边游出行，旅游客流保持高位运行。家庭出游特征更加突出。逛街购物、品尝美食、主题节事活动等提升了游客体验。滨海度假、主题乐园等一站式度假区、旅游综合体受家庭客群欢迎。假日旅游对国内居民消费拉动作用凸显。</div>
                <div>美国当地时间10月1日晚，美国拉斯维加斯露天音乐节发生枪击事件，已造成58人死亡，515人受伤。事件发生后，国家旅游局高度重视，要求驻洛杉矶旅游办事处迅速了解相关情况，与我使领馆保持密切联系，确认在当地中国游客的安危情况，要求国内出境旅游企业立即核查游客信息。目前暂无涉中国公民伤亡报告，有6名游客被困事发封锁区域，现已全部安全离开。国家旅游局将进一步跟踪事件进展，并提醒广大出境游游客注意安全。</div>
                <div><img src="static/video-bg.jpg"></div>
                <div>旅游局网站10月3日消息，国庆中秋假日第三天，全国旅游市场持续增长，市场运行平稳，无重大涉旅安全事件发生。据国家旅游局数据中心综合测算，10月3日，全国共接待国内游客1.19亿人次，同比增长9.8%，实现国内旅游收入984亿元，同比增长11.8%。</div>
                <div>中秋将至，部分短程游回程叠加周边游出行，旅游客流保持高位运行。家庭出游特征更加突出。逛街购物、品尝美食、主题节事活动等提升了游客体验。滨海度假、主题乐园等一站式度假区、旅游综合体受家庭客群欢迎。假日旅游对国内居民消费拉动作用凸显。</div>
                <div>美国当地时间10月1日晚，美国拉斯维加斯露天音乐节发生枪击事件，已造成58人死亡，515人受伤。事件发生后，国家旅游局高度重视，要求驻洛杉矶旅游办事处迅速了解相关情况，与我使领馆保持密切联系，确认在当地中国游客的安危情况，要求国内出境旅游企业立即核查游客信息。目前暂无涉中国公民伤亡报告，有6名游客被困事发封锁区域，现已全部安全离开。国家旅游局将进一步跟踪事件进展，并提醒广大出境游游客注意安全。</div>
                <div><img src="static/video-bg.jpg"></div>
                <div>旅游局网站10月3日消息，国庆中秋假日第三天，全国旅游市场持续增长，市场运行平稳，无重大涉旅安全事件发生。据国家旅游局数据中心综合测算，10月3日，全国共接待国内游客1.19亿人次，同比增长9.8%，实现国内旅游收入984亿元，同比增长11.8%。</div>
                <div>中秋将至，部分短程游回程叠加周边游出行，旅游客流保持高位运行。家庭出游特征更加突出。逛街购物、品尝美食、主题节事活动等提升了游客体验。滨海度假、主题乐园等一站式度假区、旅游综合体受家庭客群欢迎。假日旅游对国内居民消费拉动作用凸显。</div>
                <div>美国当地时间10月1日晚，美国拉斯维加斯露天音乐节发生枪击事件，已造成58人死亡，515人受伤。事件发生后，国家旅游局高度重视，要求驻洛杉矶旅游办事处迅速了解相关情况，与我使领馆保持密切联系，确认在当地中国游客的安危情况，要求国内出境旅游企业立即核查游客信息。目前暂无涉中国公民伤亡报告，有6名游客被困事发封锁区域，现已全部安全离开。国家旅游局将进一步跟踪事件进展，并提醒广大出境游游客注意安全。</div>
                <div><img src="static/video-bg.jpg"></div>
                <div>旅游局网站10月3日消息，国庆中秋假日第三天，全国旅游市场持续增长，市场运行平稳，无重大涉旅安全事件发生。据国家旅游局数据中心综合测算，10月3日，全国共接待国内游客1.19亿人次，同比增长9.8%，实现国内旅游收入984亿元，同比增长11.8%。</div>
                <div>中秋将至，部分短程游回程叠加周边游出行，旅游客流保持高位运行。家庭出游特征更加突出。逛街购物、品尝美食、主题节事活动等提升了游客体验。滨海度假、主题乐园等一站式度假区、旅游综合体受家庭客群欢迎。假日旅游对国内居民消费拉动作用凸显。</div>
                <div>美国当地时间10月1日晚，美国拉斯维加斯露天音乐节发生枪击事件，已造成58人死亡，515人受伤。事件发生后，国家旅游局高度重视，要求驻洛杉矶旅游办事处迅速了解相关情况，与我使领馆保持密切联系，确认在当地中国游客的安危情况，要求国内出境旅游企业立即核查游客信息。目前暂无涉中国公民伤亡报告，有6名游客被困事发封锁区域，现已全部安全离开。国家旅游局将进一步跟踪事件进展，并提醒广大出境游游客注意安全。</div>
                <div><img src="static/video-bg.jpg"></div>
                <div>旅游局网站10月3日消息，国庆中秋假日第三天，全国旅游市场持续增长，市场运行平稳，无重大涉旅安全事件发生。据国家旅游局数据中心综合测算，10月3日，全国共接待国内游客1.19亿人次，同比增长9.8%，实现国内旅游收入984亿元，同比增长11.8%。</div>
                <div>中秋将至，部分短程游回程叠加周边游出行，旅游客流保持高位运行。家庭出游特征更加突出。逛街购物、品尝美食、主题节事活动等提升了游客体验。滨海度假、主题乐园等一站式度假区、旅游综合体受家庭客群欢迎。假日旅游对国内居民消费拉动作用凸显。</div>
                <div>美国当地时间10月1日晚，美国拉斯维加斯露天音乐节发生枪击事件，已造成58人死亡，515人受伤。事件发生后，国家旅游局高度重视，要求驻洛杉矶旅游办事处迅速了解相关情况，与我使领馆保持密切联系，确认在当地中国游客的安危情况，要求国内出境旅游企业立即核查游客信息。目前暂无涉中国公民伤亡报告，有6名游客被困事发封锁区域，现已全部安全离开。国家旅游局将进一步跟踪事件进展，并提醒广大出境游游客注意安全。</div>
                <div><img src="static/video-bg.jpg"></div>
                <div>旅游局网站10月3日消息，国庆中秋假日第三天，全国旅游市场持续增长，市场运行平稳，无重大涉旅安全事件发生。据国家旅游局数据中心综合测算，10月3日，全国共接待国内游客1.19亿人次，同比增长9.8%，实现国内旅游收入984亿元，同比增长11.8%。</div>
                <div>中秋将至，部分短程游回程叠加周边游出行，旅游客流保持高位运行。家庭出游特征更加突出。逛街购物、品尝美食、主题节事活动等提升了游客体验。滨海度假、主题乐园等一站式度假区、旅游综合体受家庭客群欢迎。假日旅游对国内居民消费拉动作用凸显。</div>
                <div>美国当地时间10月1日晚，美国拉斯维加斯露天音乐节发生枪击事件，已造成58人死亡，515人受伤。事件发生后，国家旅游局高度重视，要求驻洛杉矶旅游办事处迅速了解相关情况，与我使领馆保持密切联系，确认在当地中国游客的安危情况，要求国内出境旅游企业立即核查游客信息。目前暂无涉中国公民伤亡报告，有6名游客被困事发封锁区域，现已全部安全离开。国家旅游局将进一步跟踪事件进展，并提醒广大出境游游客注意安全。</div>
                <div>旅游局网站10月3日消息，国庆中秋假日第三天，全国旅游市场持续增长，市场运行平稳，无重大涉旅安全事件发生。据国家旅游局数据中心综合测算，10月3日，全国共接待国内游客1.19亿人次，同比增长9.8%，实现国内旅游收入984亿元，同比增长11.8%。</div>
                <div>中秋将至，部分短程游回程叠加周边游出行，旅游客流保持高位运行。家庭出游特征更加突出。逛街购物、品尝美食、主题节事活动等提升了游客体验。滨海度假、主题乐园等一站式度假区、旅游综合体受家庭客群欢迎。假日旅游对国内居民消费拉动作用凸显。</div>
                <div>美国当地时间10月1日晚，美国拉斯维加斯露天音乐节发生枪击事件，已造成58人死亡，515人受伤。事件发生后，国家旅游局高度重视，要求驻洛杉矶旅游办事处迅速了解相关情况，与我使领馆保持密切联系，确认在当地中国游客的安危情况，要求国内出境旅游企业立即核查游客信息。目前暂无涉中国公民伤亡报告，有6名游客被困事发封锁区域，现已全部安全离开。国家旅游局将进一步跟踪事件进展，并提醒广大出境游游客注意安全。</div>
                <div>旅游局网站10月3日消息，国庆中秋假日第三天，全国旅游市场持续增长，市场运行平稳，无重大涉旅安全事件发生。据国家旅游局数据中心综合测算，10月3日，全国共接待国内游客1.19亿人次，同比增长9.8%，实现国内旅游收入984亿元，同比增长11.8%。</div>
                <div>中秋将至，部分短程游回程叠加周边游出行，旅游客流保持高位运行。家庭出游特征更加突出。逛街购物、品尝美食、主题节事活动等提升了游客体验。滨海度假、主题乐园等一站式度假区、旅游综合体受家庭客群欢迎。假日旅游对国内居民消费拉动作用凸显。</div>
                <div>美国当地时间10月1日晚，美国拉斯维加斯露天音乐节发生枪击事件，已造成58人死亡，515人受伤。事件发生后，国家旅游局高度重视，要求驻洛杉矶旅游办事处迅速了解相关情况，与我使领馆保持密切联系，确认在当地中国游客的安危情况，要求国内出境旅游企业立即核查游客信息。目前暂无涉中国公民伤亡报告，有6名游客被困事发封锁区域，现已全部安全离开。国家旅游局将进一步跟踪事件进展，并提醒广大出境游游客注意安全。</div>
                <div>旅游局网站10月3日消息，国庆中秋假日第三天，全国旅游市场持续增长，市场运行平稳，无重大涉旅安全事件发生。据国家旅游局数据中心综合测算，10月3日，全国共接待国内游客1.19亿人次，同比增长9.8%，实现国内旅游收入984亿元，同比增长11.8%。</div>
                <div>中秋将至，部分短程游回程叠加周边游出行，旅游客流保持高位运行。家庭出游特征更加突出。逛街购物、品尝美食、主题节事活动等提升了游客体验。滨海度假、主题乐园等一站式度假区、旅游综合体受家庭客群欢迎。假日旅游对国内居民消费拉动作用凸显。</div>
                <div>美国当地时间10月1日晚，美国拉斯维加斯露天音乐节发生枪击事件，已造成58人死亡，515人受伤。事件发生后，国家旅游局高度重视，要求驻洛杉矶旅游办事处迅速了解相关情况，与我使领馆保持密切联系，确认在当地中国游客的安危情况，要求国内出境旅游企业立即核查游客信息。目前暂无涉中国公民伤亡报告，有6名游客被困事发封锁区域，现已全部安全离开。国家旅游局将进一步跟踪事件进展，并提醒广大出境游游客注意安全。</div>
                <div>旅游局网站10月3日消息，国庆中秋假日第三天，全国旅游市场持续增长，市场运行平稳，无重大涉旅安全事件发生。据国家旅游局数据中心综合测算，10月3日，全国共接待国内游客1.19亿人次，同比增长9.8%，实现国内旅游收入984亿元，同比增长11.8%。</div>
                <div>中秋将至，部分短程游回程叠加周边游出行，旅游客流保持高位运行。家庭出游特征更加突出。逛街购物、品尝美食、主题节事活动等提升了游客体验。滨海度假、主题乐园等一站式度假区、旅游综合体受家庭客群欢迎。假日旅游对国内居民消费拉动作用凸显。</div>
                <div>美国当地时间10月1日晚，美国拉斯维加斯露天音乐节发生枪击事件，已造成58人死亡，515人受伤。事件发生后，国家旅游局高度重视，要求驻洛杉矶旅游办事处迅速了解相关情况，与我使领馆保持密切联系，确认在当地中国游客的安危情况，要求国内出境旅游企业立即核查游客信息。目前暂无涉中国公民伤亡报告，有6名游客被困事发封锁区域，现已全部安全离开。国家旅游局将进一步跟踪事件进展，并提醒广大出境游游客注意安全。</div>
                <div>旅游局网站10月3日消息，国庆中秋假日第三天，全国旅游市场持续增长，市场运行平稳，无重大涉旅安全事件发生。据国家旅游局数据中心综合测算，10月3日，全国共接待国内游客1.19亿人次，同比增长9.8%，实现国内旅游收入984亿元，同比增长11.8%。</div>
                <div>中秋将至，部分短程游回程叠加周边游出行，旅游客流保持高位运行。家庭出游特征更加突出。逛街购物、品尝美食、主题节事活动等提升了游客体验。滨海度假、主题乐园等一站式度假区、旅游综合体受家庭客群欢迎。假日旅游对国内居民消费拉动作用凸显。</div>
                <div>美国当地时间10月1日晚，美国拉斯维加斯露天音乐节发生枪击事件，已造成58人死亡，515人受伤。事件发生后，国家旅游局高度重视，要求驻洛杉矶旅游办事处迅速了解相关情况，与我使领馆保持密切联系，确认在当地中国游客的安危情况，要求国内出境旅游企业立即核查游客信息。目前暂无涉中国公民伤亡报告，有6名游客被困事发封锁区域，现已全部安全离开。国家旅游局将进一步跟踪事件进展，并提醒广大出境游游客注意安全。</div>
                <div>旅游局网站10月3日消息，国庆中秋假日第三天，全国旅游市场持续增长，市场运行平稳，无重大涉旅安全事件发生。据国家旅游局数据中心综合测算，10月3日，全国共接待国内游客1.19亿人次，同比增长9.8%，实现国内旅游收入984亿元，同比增长11.8%。</div>
                <div>中秋将至，部分短程游回程叠加周边游出行，旅游客流保持高位运行。家庭出游特征更加突出。逛街购物、品尝美食、主题节事活动等提升了游客体验。滨海度假、主题乐园等一站式度假区、旅游综合体受家庭客群欢迎。假日旅游对国内居民消费拉动作用凸显。</div>
                <div>美国当地时间10月1日晚，美国拉斯维加斯露天音乐节发生枪击事件，已造成58人死亡，515人受伤。事件发生后，国家旅游局高度重视，要求驻洛杉矶旅游办事处迅速了解相关情况，与我使领馆保持密切联系，确认在当地中国游客的安危情况，要求国内出境旅游企业立即核查游客信息。目前暂无涉中国公民伤亡报告，有6名游客被困事发封锁区域，现已全部安全离开。国家旅游局将进一步跟踪事件进展，并提醒广大出境游游客注意安全。</div>
                <div>旅游局网站10月3日消息，国庆中秋假日第三天，全国旅游市场持续增长，市场运行平稳，无重大涉旅安全事件发生。据国家旅游局数据中心综合测算，10月3日，全国共接待国内游客1.19亿人次，同比增长9.8%，实现国内旅游收入984亿元，同比增长11.8%。</div>
                <div>中秋将至，部分短程游回程叠加周边游出行，旅游客流保持高位运行。家庭出游特征更加突出。逛街购物、品尝美食、主题节事活动等提升了游客体验。滨海度假、主题乐园等一站式度假区、旅游综合体受家庭客群欢迎。假日旅游对国内居民消费拉动作用凸显。</div>
                <div>美国当地时间10月1日晚，美国拉斯维加斯露天音乐节发生枪击事件，已造成58人死亡，515人受伤。事件发生后，国家旅游局高度重视，要求驻洛杉矶旅游办事处迅速了解相关情况，与我使领馆保持密切联系，确认在当地中国游客的安危情况，要求国内出境旅游企业立即核查游客信息。目前暂无涉中国公民伤亡报告，有6名游客被困事发封锁区域，现已全部安全离开。国家旅游局将进一步跟踪事件进展，并提醒广大出境游游客注意安全。</div>
    
            `
        }
    },
    // mounted(){
    //     // Changing the defaults
    //     let sr = this.$sr({ reset: true, delay: 0, origin :'bottom', scale:1 });

    //     // Customizing a reveal set
    //     //sr.reveal('.foo', { duration: 200 });
    //     sr.reveal('.acontent>p', { duration: 1000 });
    // },
    updated(){
        // Changing the defaults
        let sr = this.$sr({ reset: true, delay: 0, origin :'bottom', scale:1 });

        // Customizing a reveal set
        //sr.reveal('.foo', { duration: 200 });
        sr.reveal('.acontent>p', { duration: 1000 });
    }
}
</script>


<style lang="less">
.acontent {

    div,p {
        margin: 10px 0;

        img {
            width: 100%;
        }
    }
}
</style>
